#%%
"{:+} {:-}".format(520, -250)

# %%
"{:,}".format(9999)

# %%
"{:_}".format(9999)

# %%
"{:.2f}".format(1.234)

# %%
"{:.2g}".format(1.234)
# %%
"{:.6}".format("I love bbbbbbbaaaaa")

# %%
"{:b}".format(520)
# c 输出unicode字符
# d 十进制
# o 八进制
# x 16进制
"{:#b}".format(520)
# 加#号可以提示是哪种格式

# %%
# e 科学计数法
# f 精度 6个小数位
# g 通用格式 大的用科学计数法，小的用小数
# % 百分数

"{:.2%}".format(0.98)
# %%
"{:.{perc}%}".format(0.98, perc = 2)
# %%

###################
## f字符串
###################
f"{123456:,}"
f"{-520:010}"
# %%
